# IsEmpty Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..IsEmpty Method
SelectionFilterElement Class See Also
---
Determines whether this filter's set is empty or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsEmpty()
```

Visual Basic
---
```text
Public Function IsEmpty As Boolean
```

Visual C++
---
```text
public:
bool IsEmpty()
```

# ### Return Value
True if the set is empty, otherwise false.
# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace